Show / Hide Table of Contents
Class Constants
Inheritance
System.Object
Constants
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public sealed class Constants
Fields
Improve this Doc   View Source
AutomationParam
Declaration
public const string AutomationParam = "-automation"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
CodeCheckManagerAppName
Declaration
public const string CodeCheckManagerAppName = "IdeaCodeCheck.exe"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
ConCalculatorCancelEventFormat
Declaration
public const string ConCalculatorCancelEventFormat = "IdeaStatiCa.ConnHiddenCalculatorCancel-{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
ConCalculatorChangedEventFormat
Declaration
public const string ConCalculatorChangedEventFormat = "IdeaStatiCa.ConnHiddenCalculator-{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
ConnectionChangedEventFormat
Declaration
public const string ConnectionChangedEventFormat = "IdeaStatiCaConnectionChanged{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
ConnHiddenCalculatorUrlFormat
Declaration
public const string ConnHiddenCalculatorUrlFormat = "net.pipe://localhost/IdeaStatiCa.ConnHiddenCalculator{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
DefaultIdeaStaticaAutoUrlFormat
Declaration
public const string DefaultIdeaStaticaAutoUrlFormat = "net.pipe://localhost/IdeaStatiCaAuto{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
DefaultPluginEventName
Declaration
public const string DefaultPluginEventName = "IdeaStatiCaBIMPluginEvent"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
DefaultPluginUrlFormat
Declaration
public const string DefaultPluginUrlFormat = "net.pipe://localhost/IdeaBIMPlugin{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
GrpcPortParam
Declaration
public const string GrpcPortParam = "-grpcPort"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
GrpcReflectionErrorException
Declaration
public const string GrpcReflectionErrorException = "GrpcReflectionError"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
LibraryReposPath
Declaration
public const string LibraryReposPath = "-libReposPath"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
MemberEventName
Declaration
public const string MemberEventName = "MemberPluginEvent"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
MemberHiddenCalculatorUrlFormat
Declaration
public const string MemberHiddenCalculatorUrlFormat = "net.pipe://localhost/IdeaStatiCa.MemberHiddenCalculator{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
MemberChangedEventFormat
Declaration
public const string MemberChangedEventFormat = "IdeaStatiCaMemberChanged{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
MemberUrlFormat
Declaration
public const string MemberUrlFormat = "net.pipe://localhost/IdeaMember{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
MemHiddenCalcCancelEventFormat
Declaration
public const string MemHiddenCalcCancelEventFormat = "IdeaStatiCa.MemberHiddenCalculatorCancel-{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
MemHiddenCalcChangedEventFormat
Declaration
public const string MemHiddenCalcChangedEventFormat = "IdeaStatiCa.MemberHiddenCalculator-{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
ProgressCallbackUrlFormat
Declaration
public const string ProgressCallbackUrlFormat = "net.pipe://localhost/IdeaStatiCaProgress{0}"
Field Value
 Type |  Description
 System.String
Improve this Doc   View Source
ProjectParam
Declaration
public const string ProjectParam = "-project"
Field Value
 Type |  Description
 System.String
 Improve this Doc
 View Source